thegentlecoder/zephyr/drivers/auxdisplay/auxdisplay_st_stm32_glass_lcd.c
/*
 * Copyright (c) 2026 Renato Mauro
 * SPDX-License-Identifier: Apache-2.0
 */

#define DT_DRV_COMPAT st_stm32_glass_lcd

#include <zephyr/kernel.h>
#include <zephyr/device.h>
#include <zephyr/drivers/auxdisplay.h>
#include <zephyr/drivers/pinctrl.h>
#include <zephyr/drivers/clock_control.h>
#include <zephyr/drivers/clock_control/stm32_clock_control.h>
#include <zephyr/logging/log.h>
//#include <soc.h>

/* This driver is for stm32l476g_discovery REVB or REVC, 
 * thus REVA is not supported.
 */
LOG_MODULE_REGISTER(auxdisplay_stm32_glass_lcd, CONFIG_AUXDISPLAY_LOG_LEVEL);

#define LCD_RAM_REGISTER0               (0x00000000U) /*!< LCD RAM Register 0  */
#define LCD_RAM_REGISTER1               (0x00000001U) /*!< LCD RAM Register 1  */
#define LCD_RAM_REGISTER2               (0x00000002U) /*!< LCD RAM Register 2  */
#define LCD_RAM_REGISTER3               (0x00000003U) /*!< LCD RAM Register 3  */
#define LCD_RAM_REGISTER4               (0x00000004U) /*!< LCD RAM Register 4  */
#define LCD_RAM_REGISTER5               (0x00000005U) /*!< LCD RAM Register 5  */
#define LCD_RAM_REGISTER6               (0x00000006U) /*!< LCD RAM Register 6  */
#define LCD_RAM_REGISTER7               (0x00000007U) /*!< LCD RAM Register 7  */
#define LCD_RAM_REGISTER8               (0x00000008U) /*!< LCD RAM Register 8  */
#define LCD_RAM_REGISTER9               (0x00000009U) /*!< LCD RAM Register 9  */
#define LCD_RAM_REGISTER10              (0x0000000AU) /*!< LCD RAM Register 10 */
#define LCD_RAM_REGISTER11              (0x0000000BU) /*!< LCD RAM Register 11 */
#define LCD_RAM_REGISTER12              (0x0000000CU) /*!< LCD RAM Register 12 */
#define LCD_RAM_REGISTER13              (0x0000000DU) /*!< LCD RAM Register 13 */
#define LCD_RAM_REGISTER14              (0x0000000EU) /*!< LCD RAM Register 14 */
#define LCD_RAM_REGISTER15              (0x0000000FU) /*!< LCD RAM Register 15 */

#define ASCII_CHAR_0                  0x30  /* 0 */
#define ASCII_CHAR_AT_SYMBOL          0x40  /* @ */
#define ASCII_CHAR_LEFT_OPEN_BRACKET  0x5B  /* [ */
#define ASCII_CHAR_APOSTROPHE         0x60  /* ` */
#define ASCII_CHAR_LEFT_OPEN_BRACE    0x7B  /* ( */

// Greek letter mu, i.e. micro, is ASCII 0xB5 or 0xE6.
#define ASCII_CHAR_MU                 0xB5  /* µ */
// Degree Sign or half percent is ASCII 0xB0
#define ASCII_CHAR_DEGREE_SIGN        0xB0  /* ° */
// All the segments in a position, but the dots.
#define ASCII_CHAR_FULL               0xFF

#define ASCII_DOT                     0x2E  /* . */
#define ASCII_DOUBLE_DOT              0x3A  /* : */
#define ASCII_TRIPLE_DOT              0x3B  /* ; */

/* LCD bars are handled as 4 bits, from 0 to 15.
 * Values from 0 to 9 are based on the '0' character.
 * Values from 10 to 15 are based on the 'A' character. 
 */
enum lcd_bar_value
{
  LCD_BAR_OFF  = 0x0,
  LCD_BAR_0 = LCD_BAR_OFF,			/* 0 */
  LCD_BAR_EMPTY = LCD_BAR_0,
  LCD_BAR_0_PERC = LCD_BAR_0,
  LCD_BAR_1,						/* 1 */
  LCD_BAR_25_PERC = LCD_BAR_1,
  LCD_BAR_2,						/* 2 */
  LCD_BAR_3,						/* 3 */
  LCD_BAR_HALF = LCD_BAR_3,
  LCD_BAR_50_PERC = LCD_BAR_3,
  LCD_BAR_4,						/* 4 */
  LCD_BAR_5,						/* 5 */
  LCD_BAR_6,						/* 6 */
  LCD_BAR_7,						/* 7 */
  LCD_BAR_75_PERC = LCD_BAR_7,
  LCD_BAR_8,						/* 8 */
  LCD_BAR_9,						/* 9 */
  LCD_BAR_10 = 0x41,				/* A */
  LCD_BAR_11,						/* B */
  LCD_BAR_12,						/* C */
  LCD_BAR_13,						/* D */
  LCD_BAR_14,						/* E */
  LCD_BAR_15,						/* F */
  LCD_BAR_100_PERC = LCD_BAR_15,
  LCD_BAR_FULL = LCD_BAR_15
};

/**
  @verbatim
================================================================================
                              GLASS LCD MAPPING
================================================================================
LCD allows to display informations on six 14-segment digits and 4 bars:

  1       2       3       4       5       6
-----   -----   -----   -----   -----   -----   
|\|/| o |\|/| o |\|/| o |\|/| o |\|/|   |\|/|   BAR3
-- --   -- --   -- --   -- --   -- --   -- --   BAR2
|/|\| o |/|\| o |/|\| o |/|\| o |/|\|   |/|\|   BAR1
----- * ----- * ----- * ----- * -----   -----   BAR0

LCD segment mapping:
--------------------
  -----A-----        _ 
  |\   |   /|   COL |_|
  F H  J  K B          
  |  \ | /  |        _ 
  --G-- --M--   COL |_|
  |  / | \  |          
  E Q  P  N C          
  |/   |   \|        _ 
  -----D-----   DP  |_|

 An LCD character coding is based on the following matrix:
COM           0   1   2     3
SEG(n)      { E , D , P ,   N   }
SEG(n+1)    { M , C , COL , DP  }
SEG(23-n-1) { B , A , K ,   J   }
SEG(23-n)   { G , F , Q ,   H   }
with n positive odd number.

 The character 'A' for example is:
  -------------------------------
LSB   { 1 , 0 , 0 , 0   }
      { 1 , 1 , 0 , 0   }
      { 1 , 1 , 0 , 0   }
MSB   { 1 , 1 , 0 , 0   }
      -------------------
  'A' =  F    E   0   0 hexa

BARS

Barra   | Pin Segmento | Pin Comune | Registro RAM | Bit Esatto   
Grafica |      MCU     | Associato  | LCD STM32    | nel Registro

BAR0 (Barra più bassa)   | SEG4  (PB15) | COM0LCD->RAM[0] (COM0) | Bit 4
BAR1 (Seconda dal basso) | SEG23 (PA6)  | COM1LCD->RAM[2] (COM1) | Bit 23
BAR2 (Terza dal basso)   | SEG4  (PB15) | COM2LCD->RAM[4] (COM2) | Bit 4
BAR3 (Barra più alta)    | SEG23 (PA6)  | COM3LCD->RAM[6] (COM3) | Bit 23

  @endverbatim
*/

/* Constant table for cap characters 'A' --> 'Z' */
const uint16_t CapLetterMap[26]=
    {
        /* A       B       C       D       E       F       G       H       I  */
        0xFE00, 0x6714, 0x1D00, 0x4714, 0x9D00, 0x9C00, 0x3F00, 0xFA00, 0x0014,
        /* J       K       L       M       N       O       P       Q       R  */
        0x5300, 0x9841, 0x1900, 0x5A48, 0x5A09, 0x5F00, 0xFC00, 0x5F01, 0xFC01,
        /* S       T       U       V       W       X       Y       Z  */
        0xAF00, 0x0414, 0x5b00, 0x18C0, 0x5A81, 0x00C9, 0x0058, 0x05C0
    };

/* Constant table for number '0' --> '9' */
const uint16_t NumberMap[10]=
    {
        /* 0      1      2      3      4      5      6      7      8      9  */
        0x5FC0,0x4200,0xF500,0x6700,0xEa00,0xAF00,0xBF00,0x04600,0xFF00,0xEF00
    };

/**
  * @brief LCD Glass digit position
  */
typedef enum
{
  LCD_DIGIT_POSITION_1 = 0,
  LCD_DIGIT_POSITION_2 = 1,
  LCD_DIGIT_POSITION_3 = 2,
  LCD_DIGIT_POSITION_4 = 3,
  LCD_DIGIT_POSITION_5 = 4,
  LCD_DIGIT_POSITION_6 = 5,
  LCD_DIGIT_MAX_NUMBER = 6,
}DigitPosition_Typedef;

/**
  * @brief LCD Glass point
  * Element values correspond to LCD Glass point, for positions 1 to 4.
  */

enum lcd_point
{
	POINT_OFF = 0,
  POINT_SINGLE,
	POINT_DOUBLE,
	POINT_TRIPLE
};

/* Define for scrolling sentences*/
#define SCROLL_SPEED_HIGH     150
#define SCROLL_SPEED_MEDIUM   300
#define SCROLL_SPEED_LOW      450

/* code for ' ' character */
#define C_SPACE               ((uint16_t) 0x0000)

