thegentlecoder/zephyr/drivers/auxdisplay/auxdisplay_st_stm32_glass_lcd.c
	/* Fire a hardware request telling the peripheral controller to push internal RAM data to the glass */
	HAL_LCD_UpdateDisplayRequest(&driver_data->hlcd);

	return 0;
}

/* Map implementation functions to the standard public Zephyr auxdisplay API architecture interface */
static const struct auxdisplay_driver_api stm32_lcd_aux_api = {
	.capabilities_get = stm32_lcd_capabilities_get,
	.clear = stm32_lcd_clear,
	.write = stm32_lcd_aux_write,
};

/* Core device initialization logic executed automatically by the Zephyr kernel boot sequencer */
static int stm32_lcd_aux_init(const struct device *dev)
{
	const struct stm32_lcd_config *config = dev->config;
	struct stm32_lcd_data *driver_data = dev->data;
	int ret;

	/* 1. Request clock gating initialization from the generic Zephyr device sub-system tree */
	if (!device_is_ready(config->clk_dev)) {
		LOG_ERR("STM32 Clock Control driver device is not ready");
		return -ENODEV;
	}

	ret = clock_control_on(config->clk_dev, (clock_control_subsys_t)config->pclken);
	if (ret < 0) {
		LOG_ERR("Failed to enable STM32 LCD peripheral clock gate (err: %d)", ret);
		return ret;
	}

	//k_busy_wait(10);

	/* 2. Enforce the required pin alternate configurations natively via the Pinctrl manager framework */
	ret = pinctrl_apply_state(config->pcfg, PINCTRL_STATE_DEFAULT);
	if (ret < 0) {
		LOG_ERR("Failed to apply pinctrl default operational states (err: %d)", ret);
		return ret;
	}

	/* 3. Extract the register boundaries configured within Devicetree and pipe them into the ST HAL struct */
	driver_data->hlcd.Instance = config->regs;

	/* Hardware parameters tuning extracted directly from STM32Cube peripheral specifications */
	driver_data->hlcd.Init.Prescaler = LCD_PRESCALER_1;
	driver_data->hlcd.Init.Divider = LCD_DIVIDER_31;
	driver_data->hlcd.Init.Duty = LCD_DUTY_1_4;
	driver_data->hlcd.Init.Bias = LCD_BIAS_1_3;
	driver_data->hlcd.Init.VoltageSource = LCD_VOLTAGESOURCE_INTERNAL;
	driver_data->hlcd.Init.Contrast = LCD_CONTRASTLEVEL_5;
	driver_data->hlcd.Init.DeadTime = LCD_DEADTIME_0;
	driver_data->hlcd.Init.PulseOnDuration = LCD_PULSEONDURATION_4;
	driver_data->hlcd.Init.HighDrive = LCD_HIGHDRIVE_DISABLE;
	driver_data->hlcd.Init.BlinkMode = LCD_BLINKMODE_OFF;
	driver_data->hlcd.Init.BlinkFrequency = LCD_BLINKFREQUENCY_DIV32;
	driver_data->hlcd.Init.MuxSegment = LCD_MUXSEGMENT_DISABLE;

	// __HAL_RCC_PWR_CLK_ENABLE();
	// HAL_PWR_EnableBkUpAccess();
	// //HAL_Delay(2);
	__HAL_RCC_LCD_CLK_ENABLE();
	// //HAL_Delay(2);
	//__HAL_RCC_RTC_CONFIG(RCC_RTCCLKSOURCE_LSE); 

	HAL_StatusTypeDef init_res = HAL_LCD_Init(&driver_data->hlcd);
	if ( init_res != HAL_OK) {
		LOG_ERR("STM32 HAL_LCD_Init execution failure encountered");
		LOG_DBG("DEBUG LCD: RCC_BDCR=0x%08X, LCD_CR=0x%08X, LCD_SR=0x%08X, init_res=%d\n", RCC->BDCR, LCD->CR, LCD->SR, init_res);
		return -EIO;
	}

	/* Trigger hardware core initialization macros to start internal voltage pump generators */
	__HAL_LCD_ENABLE(&driver_data->hlcd);

	LOG_INF("STM32 Segment LCD driver initialized successfully with %d digits", config->columns);
	return 0;
}

/* Advanced Devicetree generation macro mapping compile-time definitions directly to C parameters */
#define STM32_LCD_DEVICE_INIT(inst)                                             \
	PINCTRL_DT_INST_DEFINE(inst);              									\
																				\
	static const struct stm32_pclken stm32_lcd_pclken_##inst[] = {              \
		STM32_DT_INST_CLOCK_INFO_BY_IDX(inst, 0)                                \
	};																			\
																				\
	static const struct stm32_lcd_config stm32_lcd_config_##inst = {            \
		.regs = (LCD_TypeDef *)DT_INST_REG_ADDR(inst),                          \
		.pclken = stm32_lcd_pclken_##inst,                                      \
		.clk_dev = DEVICE_DT_GET(DT_INST_CLOCKS_CTLR_BY_IDX(inst, 0)),          \
		.pcfg = PINCTRL_DT_INST_DEV_CONFIG_GET(inst),                           \
		.columns = DT_INST_PROP(inst, columns),                                 \
		.rows = DT_INST_PROP(inst, rows),                                       \
	};                                                                          \
																				\
	static struct stm32_lcd_data stm32_lcd_data_##inst;                         \
																				\
	DEVICE_DT_INST_DEFINE(inst,                                                 \
			      stm32_lcd_aux_init,                                           \
			      NULL,                                                         \
			      &stm32_lcd_data_##inst,                                       \
			      &stm32_lcd_config_##inst,                                     \
			      POST_KERNEL,                                                  \
			      CONFIG_AUXDISPLAY_INIT_PRIORITY,                              \
			      &stm32_lcd_aux_api);

/* Parse the active devicetree layout and execute the instantiation macro for matching okay targets */
DT_INST_FOREACH_STATUS_OKAY(STM32_LCD_DEVICE_INIT)
